```
[1m  # aws_kms_alias.kms-alias[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_kms_alias" "kms-alias" {
      [32m+[0m [0m[1m[0marn[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m           = "alias/dev-dev-sqs-payment-router-key"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mtarget_key_arn[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mtarget_key_id[0m[0m  = (known after apply)
    }

[1m  # aws_kms_key.kms-key[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_kms_key" "kms-key" {
      [32m+[0m [0m[1m[0marn[0m[0m                                = (known after apply)
      [32m+[0m [0m[1m[0mbypass_policy_lockout_safety_check[0m[0m = false
      [32m+[0m [0m[1m[0mcustomer_master_key_spec[0m[0m           = "SYMMETRIC_DEFAULT"
      [32m+[0m [0m[1m[0mdeletion_window_in_days[0m[0m            = 30
      [32m+[0m [0m[1m[0mdescription[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0menable_key_rotation[0m[0m                = true

```